OpenNuvoton/M55M1BSP/Library/UsbHostLib/inc/usbh_uvc.h
/**************************************************************************//**
 * @file     usbh_uvc.h
 * @version  V1.00
 * @brief    USB Host UVC class driver header file.
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#ifndef _USBH_UVC_H_
#define _USBH_UVC_H_

#include "NuMicro.h"
#include "usb.h"
#include "usbh_lib.h"

/** @addtogroup LIBRARY Library
  @{
*/

/** @addtogroup USBH_Library USBH Library
  @{
*/

/** @addtogroup USBH_EXPORTED_CONSTANTS USBH Exported Constants
  @{
*/

/// @cond HIDDEN_SYMBOLS
/*--------------------------------------------------------------------------------------*/
/*  Capability settings                                                                 */
/*--------------------------------------------------------------------------------------*/

#define UVC_MAX_DEVICE          1U           /* Allowed maximum number of UVC device connected  */
#define UVC_MAX_STREAM          1U           /* Allowed maximum number of streaming interface per UVC device   */

#define UVC_MAX_ALT_IF          32U          /* Maximum number of alternative interface per UVC streaming interface supported */
#define UVC_MAX_FORMAT          24U           /* Maximum number of video stream format supported in an UVC device.    */
#define UVC_MAX_FRAME           32U          /* Maximum number of video stream frame supported in an UVC device.    */
#define UVC_MAX_STILL_IMAGE     16U          /* Maximum number of still image supported in an UVC device.    */

#define UVC_UTR_PER_STREAM      2U
// #define IF_PER_UTR           8           /* defined in usb.h                        */
#define UVC_UTR_INBUF_SIZE      ((uint32_t)(IF_PER_UTR) * 3072U)

#define UVC_REQ_TIMEOUT         50          /*!< UVC control request timeout value in tick (10ms unit)     */


/*--------------------------------------------------------------------------------------*/
/*  Debug settings                                                                      */
/*--------------------------------------------------------------------------------------*/
//#define UVC_DEBUG

#define UVC_ERRMSG      (void)usbh_printf
#ifdef UVC_DEBUG
    #define UVC_DBGMSG      (void)usbh_printf
#else
    #define UVC_DBGMSG(...)
#endif


/* Interface Class Codes (defined in usb.h) */
//#define USB_CLASS_VIDEO       0x0E

/* Video Interface Subclass Codes */
#define UVC_SC_UNDEFINED            ((uint8_t)0x00U)    /* Undefined                                 */
#define UVC_SC_VIDEOCONTROL         ((uint8_t)0x01U)    /* Video control interface                   */
#define UVC_SC_VIDEOSTREAMING       ((uint8_t)0x02U)    /* Video streaming                           */
#define UVC_SC_VIDEO_IF_COLLECT     ((uint8_t)0x03U)    /* Video interface collection                */

/* Video Interface Protocol Codes */
#define UVC_PC_PROT_UNDEFINED       0x00    /* Undefined                                 */
#define UVC_PC_PROT_15              0x01    /* Video Class version 1.5                   */

/* UVC Class-specific descritpor types */
#define UVC_CS_UNDEFINED            ((uint8_t)0x20U)
#define UVC_CS_DEVICE               ((uint8_t)0x21U)
#define UVC_CS_CONFIGURATION        ((uint8_t)0x22U)
#define UVC_CS_STRING               ((uint8_t)0x23U)
#define UVC_CS_INTERFACE            ((uint8_t)0x24U)
#define UVC_CS_ENDPOINT             ((uint8_t)0x25U)

/*
 * Video Class-Specific VC Interface Descriptor Subtypes
 */
#define VC_DESCRIPTOR_UNDEFINED     ((uint8_t)0x00U)
#define VC_HEADER                   ((uint8_t)0x01U)
#define VC_INPUT_TERMINAL           ((uint8_t)0x02U)
#define VC_OUTPUT_TERMINAL          ((uint8_t)0x03U)
#define VC_SELECTOR_UNIT            ((uint8_t)0x04U)
#define VC_PROCESSING_UNIT          ((uint8_t)0x05U)
#define VC_EXTENSION_UNIT           ((uint8_t)0x06U)
#define VC_ENCODING_UNIT            ((uint8_t)0x07U)

/*
 * Video Class-Specific VS Interface Descriptor Subtypes
 */
#define VS_UNDEFINED                ((uint8_t)0x00U)
#define VS_INPUT_HEADER             ((uint8_t)0x01U)
#define VS_OUTPUT_HEADER            ((uint8_t)0x02U)
#define VS_STILL_IMAGE_FRAME        ((uint8_t)0x03U)
#define VS_FORMAT_UNCOMPRESSED      ((uint8_t)0x04U)
#define VS_FRAME_UNCOMPRESSED       ((uint8_t)0x05U)
#define VS_FORMAT_MJPEG             ((uint8_t)0x06U)
#define VS_FRAME_MJPEG              ((uint8_t)0x07U)
#define VS_FORMAT_MPEG2TS           ((uint8_t)0x0AU)
#define VS_FORMAT_DV                ((uint8_t)0x0CU)
#define VS_COLORFORMAT              ((uint8_t)0x0DU)
#define VS_FORMAT_FRAME_BASED       ((uint8_t)0x10U)
#define VS_FRAME_FRAME_BASED        ((uint8_t)0x11U)
#define VS_FORMAT_STREAM_BASED      ((uint8_t)0x12U)
#define VS_FORMAT_H264              ((uint8_t)0x13U)
#define VS_FRAME_H264               ((uint8_t)0x14U)
#define VS_FORMAT_H264_SIMULCAST    ((uint8_t)0x15U)
#define VS_FORMAT_VP8               ((uint8_t)0x16U)
#define VS_FRAME_VP8                ((uint8_t)0x17U)
#define VS_FORMAT_VP8_SIMULCAST     ((uint8_t)0x18U)

/*
 * Video Class-Specific Endpoint Descriptor Subtypes
 */
#define UVC_EP_UNDEFINED            0x00
#define UVC_EP_GENERAL              0x01
#define UVC_EP_ENDPOINT             0x02
#define UVC_EP_INTERRUPT            0x03


/*
 * Video Class-Specific Request Codes
 */
#define UVC_RC_UNDEFINED            0x00
#define UVC_SET_CUR                 ((uint8_t)0x01U)
#define UVC_SET_CUR_ALL             0x11
#define UVC_GET_CUR                 ((uint8_t)0x81U)
#define UVC_GET_MIN                 ((uint8_t)0x82U)
#define UVC_GET_MAX                 ((uint8_t)0x83U)
#define UVC_GET_RES                 ((uint8_t)0x84U)
#define UVC_GET_LEN                 ((uint8_t)0x85U)
#define UVC_GET_INFO                ((uint8_t)0x86U)
#define UVC_GET_DEF                 ((uint8_t)0x87U)
#define UVC_GET_CUR_ALL             0x91
#define UVC_GET_MIN_ALL             0x92
#define UVC_GET_MAX_ALL             0x93
#define UVC_GET_RES_ALL             0x94
#define UVC_GET_DEF_ALL             0x97


