OpenNuvoton/M55M1BSP/Library/UsbHostLib/inc/usbh_uvc.h
/*
 * VideoControl Interface Control Selectors
 */
#define VC_CONTROL_UNDEFINED               0x00
#define VC_VIDEO_POWER_MODE_CONTROL        0x01
#define VC_REQUEST_ERROR_CODE_CONTROL      0x02
#define VC_RESEVED                         0x03


/*
 * Terminal Control Selectors
 */
#define TE_CONTROL_UNDEFINED               0x00


/*
 * Selector Unit Control Selectors
 */
#define SU_CONTROL_UNDEFINED               0x00
#define SU_INPUT_SELECT_CONTROL            0x01


/*
 * Camera Terminal Control Selectors
 */
#define SU_CONTROL_UNDEFINED               0x00
#define CT_SCANNING_MODE_CONTROL           0x01
#define CT_AE_MODE_CONTROL                 0x02
#define CT_AE_PRIORITY_CONTROL             0x03
#define CT_EXPOSURE_TIME_ABSOLUTE_CONTROL  0x04
#define CT_EXPOSURE_TIME_RELATIVE_CONTROL  0x05
#define CT_FOCUS_ABSOLUTE_CONTROL          0x06
#define CT_FOCUS_RELATIVE_CONTROL          0x07
#define CT_FOCUS_AUTO_CONTROL              0x08
#define CT_IRIS_ABSOLUTE_CONTROL           0x09
#define CT_IRIS_RELATIVE_CONTROL           0x0A
#define CT_ZOOM_ABSOLUTE_CONTROL           0x0B
#define CT_ZOOM_RELATIVE_CONTROL           0x0C
#define CT_PANTILT_ABSOLUTE_CONTROL        0x0D
#define CT_PANTILT_RELATIVE_CONTROL        0x0E
#define CT_ROLL_ABSOLUTE_CONTROL           0x0F
#define CT_ROLL_RELATIVE_CONTROL           0x10
#define CT_PRIVACY_CONTROL                 0x11
#define CT_FOCUS_SIMPLE_CONTROL            0x12
#define CT_WINDOW_CONTROL                  0x13
#define CT_REGION_OF_INTEREST_CONTROL      0x14


/*
 * Processing Unit Control Selectors
 */
#define PU_CONTROL_UNDEFINED                       0x00
#define PU_BACKLIGHT_COMPENSATION_CONTROL          0x01
#define PU_BRIGHTNESS_CONTROL                      0x02
#define PU_CONTRAST_CONTROL                        0x03
#define PU_GAIN_CONTROL                            0x04
#define PU_POWER_LINE_FREQUENCY_CONTROL            0x05
#define PU_HUE_CONTROL                             0x06
#define PU_SATURATION_CONTROL                      0x07
#define PU_SHARPNESS_CONTROL                       0x08
#define PU_GAMMA_CONTROL                           0x09
#define PU_WHITE_BALANCE_TEMPERATURE_CONTROL       0x0A
#define PU_WHITE_BALANCE_TEMPERATURE_AUTO_CONTROL  0x0B
#define PU_WHITE_BALANCE_COMPONENT_CONTROL         0x0C
#define PU_WHITE_BALANCE_COMPONENT_AUTO_CONTROL    0x0D
#define PU_DIGITAL_MULTIPLIER_CONTROL              0x0E
#define PU_DIGITAL_MULTIPLIER_LIMIT_CONTROL        0x0F
#define PU_HUE_AUTO_CONTROL                        0x10
#define PU_ANALOG_VIDEO_STANDARD_CONTROL           0x11
#define PU_ANALOG_LOCK_STATUS_CONTROL              0x12
#define PU_CONTRAST_AUTO_CONTROL                   0x13


/*
 * Encoding Unit Control Selectors
 */
#define EU_CONTROL_UNDEFINED               0x00
#define EU_SELECT_LAYER_CONTROL            0x01
#define EU_PROFILE_TOOLSET_CONTROL         0x02
#define EU_VIDEO_RESOLUTION_CONTROL        0x03
#define EU_MIN_FRAME_INTERVAL_CONTROL      0x04
#define EU_SLICE_MODE_CONTROL              0x05
#define EU_RATE_CONTROL_MODE_CONTROL       0x06
#define EU_AVERAGE_BITRATE_CONTROL         0x07
#define EU_CPB_SIZE_CONTROL                0x08
#define EU_PEAK_BIT_RATE_CONTROL           0x09
#define EU_QUANTIZATION_PARAMS_CONTROL     0x0A
#define EU_SYNC_REF_FRAME_CONTROL          0x0B
#define EU_LTR_BUFFER_                     0x0C
#define EU_LTR_PICTURE_CONTROL             0x0D
#define EU_LTR_VALIDATION_CONTROL          0x0E
#define EU_LEVEL_IDC_LIMIT_CONTROL         0x0F
#define EU_SEI_PAYLOADTYPE_CONTROL         0x10
#define EU_QP_RANGE_CONTROL                0x11
#define EU_PRIORITY_CONTROL                0x12
#define EU_START_OR_STOP_LAYER_CONTROL     0x13
#define EU_ERROR_RESILIENCY_CONTROL        0x14


/*
 * Extension Unit Control Selectors
 */
#define XU_CONTROL_UNDEFINED               0x00


/*
 * VideoStreaming Interface Control Selectors
 */
#define VS_CONTROL_UNDEFINED               0x00
#define VS_PROBE_CONTROL                   0x01
#define VS_COMMIT_CONTROL                  0x02
#define VS_STILL_PROBE_CONTROL             0x03
#define VS_STILL_COMMIT_CONTROL            0x04
#define VS_STILL_IMAGE_TRIGGER_CONTROL     0x05
#define VS_STREAM_ERROR_CODE_CONTROL       0x06
#define VS_GENERATE_KEY_FRAME_CONTROL      0x07
#define VS_UPDATE_FRAME_SEGMENT_CONTROL    0x08
#define VS_SYNCH_DELAY_CONTROL             0x09


/*
 * USB Terminal Types
 */
#define TT_VENDOR_SPECIFIC                 0x0100
#define TT_STREAMING                       0x0101


/*
 * Input Terminal Types
 */
#define ITT_VENDOR_SPECIFIC                0x0200
#define ITT_CAMERA                         0x0201
#define ITT_MEDIA_TRANSPORT_INPUT          0x0202


/*
 * Output Terminal Types
 */
#define OTT_VENDOR_SPECIFIC                0x0300
#define OTT_DISPLAY                        0x0301
#define OTT_MEDIA_TRANSPORT_OUTPUT         0x0302


/*
 * External Terminal Types
 */
#define EXTERNAL_ VENDOR_SPECIFIC          0x0400
#define COMPOSITE_CONNECTOR                0x0401
#define SVIDEO_CONNECTOR                   0x0402
#define COMPONENT_CONNECTOR                0x0403



/*-----------------------------------------------------------------------------------
 *  Video Class-specific interface descriptor header
 */

/*  Standard Video Interface Collection IAD */
typedef struct __attribute__((__packed__)) desc_vc_iad_t
{
    uint8_t  bLength;                  /* 0x08: Size of this descriptor, in bytes        */
    uint8_t  bDescriptorType;          /* 0x0B: INTERFACE ASSOCIATION Descriptor         */
    uint8_t  bFirstInterface;          /* Interface number of the VideoControl interface */
    uint8_t  bInterfaceCount;          /* Number of contiguous Video interfaces          */
    uint8_t  bFunctionClass;           /* 0x0E: CC_VIDEO                                 */
    uint8_t  bFunctionSubClass;        /* 0x03: SC_VIDEO_INTERFACE_COLLECTION            */
    uint8_t  bFunctionProtocol;        /* 0x00: Not used.                                */
    uint8_t  iFunction;                /* Index to string descriptor                     */
} DESC_VC_IAD_T;


/* VC_HEADER */
typedef struct __attribute__((__packed__)) desc_vc_hdr_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x01: VC_HEADER                                */
    uint16_t bcdUVC;                   /* Video Device Class Specification release number in binary-coded decimal */
    uint16_t wTotalLength;             /* Total number of bytes returned for the class-specific VideoControl interface descriptor. Includes the combined length of this descriptor header and all Unit and Terminal descriptors. */
    uint32_t dwClockFrequency;         /* Use of this field has been deprecated.         */
    uint8_t  bInCollection;            /* The number of VideoStreaming interfaces        */
    uint8_t  baInterfaceNr;            /* Interface number of VideoStreaming interface   */
} DESC_VC_HDR_T;


/* VC_INPUT_TERMINAL */
typedef struct __attribute__((__packed__)) desc_vc_it_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x02: VC_INPUT_TERMINAL                        */
    uint8_t  bTerminalID;              /* Unique terminal ID                             */
    uint16_t wTerminalType;            /* Terminal types                                 */
    uint8_t  bAssocTerminal;           /* ID of the Output Terminal to which this Input Terminal is associated, or zero (0) if no such association exists.    */
    uint8_t  iTerminal;                /* Index of a string descriptor                   */
} DESC_VC_IT_T;


/* VC_OUTPUT_TERMINAL */
typedef struct __attribute__((__packed__)) desc_vc_ot_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x03: VC_OUTPUT_TERMINAL                       */
    uint8_t  bTerminalID;              /* Unique terminal ID                             */
    uint16_t wTerminalType;            /* Terminal types                                 */
    uint8_t  bAssocTerminal;           /* Constant, identifying the Input Terminal to which this Output Terminal is associated, or zero (0) if no such association exists.  */
    uint8_t  bSourceID;                /* ID of the Unit or Terminal to which this Terminal is connected.  */
    uint8_t  iTerminal;                /* Index of a string descriptor                   */
} DESC_VC_OT_T;


/* VC_SELECTOR_UNIT */
typedef struct __attribute__((__packed__)) desc_vc_su_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x04: VC_SELECTOR_UNIT                         */
    uint8_t  bUnitID;                  /* Unique terminal ID. This value is used in all requests to address this Unit. */
    uint8_t  bNrInPins;                /* Number of Input Pins of this Unit              */
    uint8_t  bSourceID[4];             /* ID of the Unit or Terminal Input Pins          */
} DESC_VC_SU_T;


