OpenNuvoton/M55M1BSP/Library/UsbHostLib/inc/usbh_uvc.h
/* VC_PROCESSING_UNIT */
typedef struct __attribute__((__packed__)) desc_vc_pu_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x05: VC_PROCESSING_UNIT                       */
    uint8_t  bUnitID;                  /* Unique terminal ID. This value is used in all requests to address this Unit. */
    uint8_t  bSourceID;                /* ID of the Unit or Terminal to which this Unit is connected.   */
    uint16_t wMaxMultiplier;           /* If the Digital Multiplier control is supported, this field indicates the maximum digital magnification, multiplied by 100. For example, for a device that supports 1-4.5X digital zoom (a multiplier of 4.5), this field would be set to 450. If the Digital Multiplier control is not supported, this field shall be set to 0.   */
    uint8_t  bControlSize;             /* Size of the bmControls field, in bytes: 3      */
    uint8_t  bmControls[3];            /* A bit set to 1 indicates that the mentioned Control is supported for the video stream.   */
    /* D0: Brightness                                 */
    /* D1: Contrast                                   */
    /* D2: Hue                                        */
    /* D3: Saturation                                 */
    /* D4: Sharpness                                  */
    /* D5: Gamma                                      */
    /* D6: White Balance Temperature                  */
    /* D7: White Balance Component                    */
    /* D8: Backlight Compensation                     */
    /* D9: Gain                                       */
    /* D10: Power Line Frequency                      */
    /* D11: Hue, Auto                                 */
    /* D12: White Balance Temperature, Auto           */
    /* D13: White Balance Component, Auto             */
    /* D14: Digital Multiplier                        */
    /* D15: Digital Multiplier Limit                  */
    /* D16: Analog Video Standard                     */
    /* D17: Analog Video Lock Status                  */
    /* D18: Contrast, Auto                            */
    /* D19 – D23: Reserved. Set to zero.              */
    uint8_t  iProcessing;              /* Index of a string descriptor                   */
    uint8_t  bmVideoStandards;         /* A bitmap of all analog video standards supported by the Processing Unit.  */
    /* D0: None                                       */
    /* D1: NTSC – 525/60                              */
    /* D2: PAL – 625/50                               */
    /* D3: SECAM – 625/50                             */
    /* D4: NTSC – 625/50                              */
    /* D5: PAL – 525/60                               */
    /* D6: White Balance Temperature                  */
    /* D6-D7: Reserved. Set to zero.                  */
} DESC_VC_PU_T;


/* VC_EXTENSION_UNIT */
typedef struct __attribute__((__packed__)) desc_vc_eu_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x04: VC_EXTENSION_UNIT                        */
    uint8_t  bUnitID;                  /* Unique terminal ID. This value is used in all requests to address this Unit. */
    uint32_t guidExtensionCode[4];     /* Vendor-specific code identifying theExtension Unit  */
    uint8_t  bNumControls;             /* Number of controls in this extension unit      */
    uint8_t  bNrInPins;                /* Number of Input Pins of this Unit              */
} DESC_VC_EU_T;


/* VC_ENCODING_UNIT */
typedef struct __attribute__((__packed__)) desc_vc_ecu_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x04: VC_ENCODING_UNIT                         */
    uint8_t  bUnitID;                  /* Unique terminal ID. This value is used in all requests to address this Unit. */
    uint8_t  bSourceID;                /* ID of the Unit or Terminal to which this Unit is connected.   */
    uint8_t  iEncoding;                /* Index of a string descriptor                   */
    uint8_t  bControlSize;             /* Size, in bytes, of the bmControls and bmControlsRuntime fields: The value must be 3.  */
    uint8_t  bmControls[3];            /* A bit set to 1 indicates that the specified control is supported for initialization */
    uint8_t  bmControlsRuntime[3];     /* A bit set to 1 indicates that the mentioned control is supported during runtime. */
} DESC_VC_ECU_T;


/* Class-specific VC Interrupt Endpoint Descriptor */
typedef struct __attribute__((__packed__)) desc_vc_epi_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x25: CS_ENDPOINT                              */
    uint8_t  bDescriptorSubType;       /* 0x03: EP_INTERRUPT                             */
    uint16_t wMaxTransferSize;         /* Maximum interrupt structure size this endpoint is capable of sending. */
} DESC_VC_EPI_T;


/* VS_INPUT_HEADER */
typedef struct __attribute__((__packed__)) desc_vsi_hdr_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x01: VS_INPUT_HEADER                          */
    uint8_t  bNumFormats;              /* Number of video payload Format descriptors     */
    uint16_t wTotalLength;             /* Total number of bytes returned for the class-specific VideoStreaming interface descriptors including this header descriptor.  */
    uint8_t  bEndpointAddress;         /* The address of the isochronous or bulk endpoint used for video data. */
    uint8_t  bmInfo;                   /* Indicates the capabilities of this VideoStreaming interface   */
    uint8_t  bTerminalLink;            /* The terminal ID of the Output Terminal to which the video endpoint of this interface is connected.  */
    uint8_t  bStillCaptureMethod;      /* Method of still image capture supported        */
    uint8_t  bTriggerSupport;          /* Specifies if hardware triggering is supported through this interface  */
    uint8_t  bTriggerUsage;            /* Specifies how the host software shall respond to a hardware trigger interrupt event from this interface.  */
    uint8_t  bControlSize;             /* Size of each bmaControls(x) field, in bytes.   */
} DESC_VSI_HDR_T;


/* VS_STILL_IMAGE_FRAME */
typedef struct __attribute__((__packed__)) still_image_size_t
{
    uint16_t wWidth;                   /* Width of the still image size */
    uint16_t wHeight;                  /* Height of the still image size */
} STILL_IMAGE_SIZE_T;

typedef struct __attribute__((__packed__)) desc_still_image_frame_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x03: VS_STILL_IMAGE_FRAME                     */
    uint8_t  bEndpointAddress;         /* The address of the isochronous or bulk endpoint used for video data. */
    uint8_t  bNumImageSizePatterns;    /* Number of Image Size patterns of this format: n */
    STILL_IMAGE_SIZE_T wSize[UVC_MAX_STILL_IMAGE];               /* Width and height of the still image size (max is 16) */
    uint8_t  bNumCompressionPatterns;  /* Number of Compression pattern of this format: m */
} DESC_STILL_IMAGE_FRAME_T;

/*-----------------------------------------------------------------------------------
 *  Video Class-specific format and frame descriptors
 */

/* VS_FORMAT_UNCOMPRESSED */
typedef struct __attribute__((__packed__)) desc_vsu_format_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x04: VS_FORMAT_UNCOMPRESSED                   */
    uint8_t  bFormatIndex;             /* Index of this format descriptor                */
    uint8_t  bNumFrameDescriptors;     /* Number of frame descriptors following that correspond to this format  */
    uint32_t guidFormat[4];            /* Globally Unique Identifier used to identify stream-encoding format */
    uint8_t  bBitsPerPixel;            /* Number of bits per pixel used to specify color in the decoded video frame  */
    uint8_t  bDefaultFrameIndex;       /* Optimum Frame Index (used to select resolution) for this stream.  */
    uint8_t  bAspectRatioX;            /* The X dimension of the picture aspect ratio.   */
    uint8_t  bAspectRatioY;            /* The Y dimension of the picture aspect ratio.   */
    uint8_t  bmInterlaceFlags;         /* Specifies interlace information.               */
    uint8_t  bCopyProtect;             /* Specifies whether duplication of the video stream is restricted   */
} DESC_VSU_FORMAT_T;


/* VS_FRAME_UNCOMPRESSED */
typedef struct __attribute__((__packed__)) desc_vsu_frame_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x05: VS_FRAME_UNCOMPRESSED                    */
    uint8_t  bFrameIndex;              /* Index of this frame descriptor                 */
    uint8_t  bmCapabilities;
    uint16_t wWidth;                   /* Width of decoded bitmap frame in pixels        */
    uint16_t wHeight;                  /* Height of decoded bitmap frame in pixels       */
    uint32_t dwMinBitRate;             /* Specifies the minimum bit rate at the longest frame interval in units of bps at which the data can be transmitted. */
    uint32_t dwMaxBitRate;             /* Specifies the maximum bit rate at the shortest frame interval in units of bps at which the data can be transmitted. */
    uint32_t dwMaxVideoFrameBufferSize;/* Use of this field has been deprecated.         */
    uint32_t dwDefaultFrameInterval;   /* Specifies the frame interval the device would like to indicate for use as a default.   */
    uint8_t  bFrameIntervalType;       /* Indicates how the frame interval can be programmed */
    uint32_t dwMinFrameInterval;       /* Shortest frame interval supported (at highest frame rate), in 100 ns units. */
    uint32_t dwMaxFrameInterval;       /* Longest frame interval supported (at lowest frame rate), in 100 ns units.  */
    uint32_t dwFrameIntervalStep;      /* Indicates granularity of frame interval range, in 100 ns units. */
} DESC_VSU_FRAME_T;


