OpenNuvoton/M55M1BSP/Library/UsbHostLib/inc/usbh_uvc.h
/* VS_FORMAT_MJPEG */
typedef struct __attribute__((__packed__)) desc_mpjg_format_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x06: VS_FORMAT_MJPEG                          */
    uint8_t  bFormatIndex;             /* Index of this format descriptor                */
    uint8_t  bNumFrameDescriptors;     /* Number of frame descriptors following that correspond to this format  */
    uint8_t  bmFlags;                  /* Specifies characteristics of this format.      */
    uint8_t  bDefaultFrameIndex;       /* Optimum Frame Index (used to select resolution) for this stream.  */
    uint8_t  bAspectRatioX;            /* The X dimension of the picture aspect ratio.   */
    uint8_t  bAspectRatioY;            /* The Y dimension of the picture aspect ratio.   */
    uint8_t  bmInterlaceFlags;         /* Specifies interlace information.               */
    uint8_t  bCopyProtect;             /* Specifies whether duplication of the video stream is restricted   */
} DESC_MJPG_FORMAT_T;


/* VS_FRAME_MJPEG */
typedef struct __attribute__((__packed__)) desc_mjpg_frame_t
{
    uint8_t  bLength;                  /* Size of this descriptor, in bytes              */
    uint8_t  bDescriptorType;          /* 0x24: CS_INTERFACE                             */
    uint8_t  bDescriptorSubType;       /* 0x07: VS_FRAME_MJPEG                           */
    uint8_t  bFrameIndex;              /* Index of this frame descriptor                 */
    uint8_t  bmCapabilities;
    uint16_t wWidth;                   /* Width of decoded bitmap frame in pixels        */
    uint16_t wHeight;                  /* Height of decoded bitmap frame in pixels       */
    uint32_t dwMinBitRate;             /* Specifies the minimum bit rate at the longest frame interval in units of bps at which the data can be transmitted. */
    uint32_t dwMaxBitRate;             /* Specifies the maximum bit rate at the shortest frame interval in units of bps at which the data can be transmitted. */
    uint32_t dwMaxVideoFrameBufferSize;/* Use of this field has been deprecated.         */
    uint32_t dwDefaultFrameInterval;   /* Specifies the frame interval the device would like to indicate for use as a default.   */
    uint8_t  bFrameIntervalType;       /* Indicates how the frame interval can be programmed */
    uint32_t dwMinFrameInterval;       /* Shortest frame interval supported (at highest frame rate), in 100 ns units. */
    uint32_t dwMaxFrameInterval;       /* Longest frame interval supported (at lowest frame rate), in 100 ns units.  */
    uint32_t dwFrameIntervalStep;      /* Indicates granularity of frame interval range, in 100 ns units. */
} DESC_MJPG_FRAME_T;

struct uvc_dev_t;

/*
 *  Payload Header
 */
#define UVC_PL_EOH    ((uint8_t)0x80U)
#define UVC_PL_ERR    ((uint8_t)0x40U)
#define UVC_PL_STI    ((uint8_t)0x20U)
#define UVC_PL_RES    ((uint8_t)0x10U)
#define UVC_PL_SCR    ((uint8_t)0x08U)
#define UVC_PL_PTS    ((uint8_t)0x04U)
#define UVC_PL_EOF    ((uint8_t)0x02U)
#define UVC_PL_FID    ((uint8_t)0x01U)

typedef struct uvc_ctrl_t
{
    uint8_t           ep_num_sts;           /* interrupt in endpoint address              */
    uint8_t           num_of_formats;       /* total number of video formats              */
    uint8_t           format_idx[UVC_MAX_FORMAT];  /* format index                        */
    IMAGE_FORMAT_E    format[UVC_MAX_FORMAT];      /* video format                        */
    uint8_t           num_of_frames;        /* total number of video frame types          */
    uint8_t           frame_idx[UVC_MAX_FRAME];    /* frame index                         */
    uint8_t           num_of_still_frames;         /*total number of still frame types*/
    IMAGE_FORMAT_E    frame_format[UVC_MAX_FRAME]; /* frame format                        */
    IMAGE_FORMAT_E     still_image_format[UVC_MAX_FRAME]; /* still image format            */
    uint16_t          width[UVC_MAX_FRAME]; /* frame width                                */
    uint16_t          height[UVC_MAX_FRAME];/* frame height                               */
    uint16_t          still_image_width[UVC_MAX_STILL_IMAGE]; /* still image width        */
    uint16_t          still_image_height[UVC_MAX_STILL_IMAGE];/* still image height       */
}   UVC_CTRL_T;

typedef struct uvc_strm_t
{
    uint8_t           ep_addr;              /* endpoint address                           */
    uint8_t           num_of_alt;           /* total number of alternative interface      */
    uint8_t           alt_no[UVC_MAX_ALT_IF];
    uint16_t          max_pktsz[UVC_MAX_ALT_IF];
    uint8_t           current_frame_error;  /* indicate error detected in the current frame while parsing the video stream */
    uint8_t           current_frame_toggle; /* indicate the toggle bit of current frame while parsing the video stream */
}   UVC_STRM_T;


typedef struct __attribute__((__packed__)) uvc_ctrl_param_t
{
    uint16_t          bmHint;               /* Bitfield control indicating to the function what fields shall be kept fixed */
    uint8_t           bFormatIndex;         /* Video format index from a Format descriptor for this video interface. */
    uint8_t           bFrameIndex;          /* Video frame index from a Frame descriptor. */
    uint32_t          dwFrameInterval;      /* Frame interval in 100 ns units.            */
    uint16_t          wKeyFrameRate;        /* Key frame rate in key-frame per video-frame units.  */
    uint16_t          wPFrameRate;          /* P Frame rate in PFrame/key frame units.    */
    uint16_t          wCompQuality;         /* Compression quality control in abstract units 1 (lowest) to 10000 (highest).   */
    uint16_t          wCompWindowSize;      /* Window size for average bit rate control.  */
    uint16_t          wDelay;               /* Internal video streaming interface latency in ms from video data capture to presentation on the USB.  */
    uint32_t          dwMaxVideoFrameSize;  /* Maximum video frame or codec-specific segment size in bytes.  */
    uint32_t          dwMaxPayloadTransferSize;  /* Specifies the maximum number of bytes that the device can transmit or receive in a single payload transfer. This field must be supported. */
    uint32_t          dwClockFrequency;     /* The device clock frequency in Hz for the specified format. */
    uint8_t           bmFramingInfo;        /* This control indicates to the function whether payload transfers will contain out-of-band framing information in the Video Payload Header. */
    uint8_t           bPreferedVersion;     /* The preferred payload format version supported by the host or device for the specified bFormatIndex value */
    uint8_t           bMinVersion;          /* The minimum payload format version supported by the device for the specified bFormatIndex value. */
    uint8_t           bMaxVersion;          /* The maximum payload format version supported by the device for the specified bFormatIndex value. */
    uint8_t           bUsage;               /* This bitmap enables features reported by the bmUsages field of the Video Frame Descriptor. */
    uint8_t           bBitDepthLuma;        /* Represents bit_depth_luma_minus8 + 8, which must be the same as bit_depth_chroma_minus8 + 8. */
    uint8_t           bmSettings;           /* A bitmap of flags that is used to discover and control specific features of a temporally encoded video stream. */
    uint8_t           bMaxNumberOfRefFramesPlus1;  /* Host indicates the maximum number of frames stored for use as references. */
    uint16_t          bmRateControlModes;   /* This field contains 4 subfields, each of which is a 4 bit number. */
    uint8_t           bmLayoutPerStream[8]; /* This field contains 4 subfields, each of which is a 2 byte number. */
}   UVC_CTRL_PARAM_T;

typedef struct __attribute__((__packed__)) uvc_still_ctrl_param_t
{
    uint8_t           bFormatIndex;         /* Video format index from a Format descriptor. */
    uint8_t           bFrameIndex;          /* Video frame index from a Frame descriptor. */
    uint8_t           bCompressionIndex;    /* Compression index from a Frame descriptor. */
    uint32_t          dwMaxVideoFrameSize;  /* Maximum still image size in bytes. */
    uint32_t          dwMaxPayloadTransferSize;  /* Specifies the maximum number of bytes that the device can transmit or receive in a single payload transfer. */
}   UVC_STILL_CTRL_PARAM_T;

/// @endcond HIDDEN_SYMBOLS

/** @} end of group USBH_EXPORTED_CONSTANTS */

/** @addtogroup USBH_EXPORTED_STRUCTURES USBH Exported Structures
  @{
*/

