OpenNuvoton/M55M1BSP/Library/UsbHostLib/inc/usbh_uvc.h
/*
 * USB-specific UVC device struct
 */
typedef struct uvc_dev_t
{
    UDEV_T            *udev;
    char              version;        /*!< USB Video Class version. 0x00: 1.1; 0x01: 1.5      */
    UVC_CTRL_T        vc;             /*!< Video control interface stuff                      */
    UVC_STRM_T        vs;             /*!< Video streaming interface stuff                    */
    IFACE_T           *iface_ctrl;    /*!< Video control interface                            */
    IFACE_T           *iface_stream;  /*!< Video streaming interface                          */
    UVC_CTRL_PARAM_T  param;          /*!< Video control parameter block                      */
    UVC_STILL_CTRL_PARAM_T  still_param; /*!< Video still control parameter block             */
    uint8_t           is_streaming;   /*!< Video is currently streaming or not                */
    EP_INFO_T         *ep_iso_in;     /*!< Isochronous in endpoint                            */
    uint8_t           *in_buff;       /*!< Isochronous streaming in buffer                    */
    UTR_T             *utr_rx[UVC_UTR_PER_STREAM];    /*!< Isochronous-in UTRs                */
    uint8_t           *img_buff;      /*!< Image buffer provided by user                      */
    int               img_buff_size;  /*!< Size of the image buffer provided by user          */
    int               img_size;       /*!< Size of the image data stored in img_buff          */
    int               img_sti;        /*!< Still image trigger bit in the payload header       */
    UVC_CB_FUNC       *func_rx;       /*!< user callback function for receiving images        */
    struct uvc_dev_t  *next;          /*!< next UVC devide                                    */
}   UVC_DEV_T;

/** @} end of group USBH_EXPORTED_STRUCTURES */

/// @cond HIDDEN_SYMBOLS
//export functions
extern int uvc_parse_control_interface(UVC_DEV_T *vdev, IFACE_T *iface);
extern int uvc_parse_streaming_interface(UVC_DEV_T *vdev, IFACE_T *iface);
extern int usbh_uvc_probe_control(UVC_DEV_T *vdev, uint8_t req, UVC_CTRL_PARAM_T *param);
/// @endcond HIDDEN_SYMBOLS

#ifdef __cplusplus
extern "C" {
#endif

/** @} end of group USBH_Library */

/** @} end of group LIBRARY */

#ifdef __cplusplus
}
#endif

#endif /* _USBH_UVC_H_ */
